W7/W7D5/Reddit_Clone/app/models/user.rb

SELECT 1 AS one FROM "users" WHERE "users"."session_token" = ? LIMIT ?  [["session_token", "[FILTERED]"], ["LIMIT", 1]]
---
    def generate_unique_session_token
        token = SecureRandom::urlsafe_base64

        while User.exists?(session: [session_token: token])