W7/W7D5/Reddit_Clone/app/controllers/application_controller.rb

    def current_user
        @user ||= User.find_by(session_token: session[:session_token])
---
SELECT "users".* FROM "users" WHERE "users"."session_token" = ? LIMIT ?  [["session_token", "[FILTERED]"], ["LIMIT", 1]]