W7/W7D5/Reddit_Clone/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "session_token", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "wilson"], ["session_token", "[FILTERED]"], ["password_digest", "[FILTERED]"], ["created_at", "2022-09-02 17:43:10.432634"], ["updated_at", "2022-09-02 17:43:10.432634"]]
---
    def create
        @user = User.new(user_params)

        if @user.save